Autodesk.Revit.DB.ViewCropRegionShapeManager.GetSplitRegionMaximum(System.Int32)
Returns the proportional location of the maximum boundary of the specified split crop region.
regionIndex:
Index of region to be split horizontally (numbering starts with 0).
Returns:
A value from 0 to 1 representing the maximum location for the regions split boundary.
This number represents the location as a ratio along the non-split rectangular crop.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The provided region index is invalid.
Since:
2016

Autodesk.Revit.DB.ViewCropRegionShapeManager.GetSplitRegionMinimum(System.Int32)
Returns the proportional location of the minimum boundary of the specified split crop region.
regionIndex:
Index of region to be split horizontally (numbering starts with 0).
Returns:
A value from 0 to 1 representing the minimum location for the regions split boundary.
This number represents the location as a ratio along the non-split rectangular crop.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The provided region index is invalid.
Since:
2016